<?php

namespace App\Helpers;

class LetterSponserMap
{
    static $sponsers = [
        "7001378525" => 'شركة الكفاح لمواد البناء مساهمة مقفلة',
        "7001454094" => "شركة الكفاح القابضـــة",
        "7001569115" => "شركة الكفاح التجاريه",
        "7001569826" => "شركة الكفاح للخرسانه المسبقه الصنع",
        "7001573273" => "شركة الكفاح العقارية",
        "7001573638" => "شركة المطورون العالميه",
        "7001625107" => "شركة الكفاح للمنتجات الورقية",
        "7004069782" => "القوى المتميزة التجارية",
        "7004297979" => "مدار التقنية للاتصالات وتقنية المعلومات",
        "7005620625" => "شركة إمداد الأمثل لخدمات الإعاشة",
        "7006355593" => "شركة الكفاح لمعدات البناء",
        "7006636109" => "شركة الكفاح للمقاولات العامة",
        "7007917771" => "الرؤية الهندسية المتقدمة لاعمال الكهروميكانيكا",
        "7008608585" => "شركة إنار للطاقة المتجددة",
        "7009383964" => "شركة تمويل الاولى مساهمه مقفلة",
        "7011291965" => "مطابع الكفاح الحديثة فرع شركة الكفاح القابضة",
        "7011737652" => "شركة الكفاح لمعدات البناء فرع شركة الكفاح لمواد البناء",
        "7011778425" => "مصنع الكفاح للطابوق فرع شركة الكفاح لمواد البناء",
        "7012103938" => "مدارس اكاديمية الكفاح الأهلية للتعليم",
        "7012158551" => "فرع شركة الكفاح العقارية",
        "7012185646" => "وليد حسن العفالق مقاولات ماسة هجر بالصناعية",
        "7012283227" => "مصنع الكفاح للخرسانة الجاهزة فرع شركة الكفاح لمواد البناء",
        "7012457771" => "مصنع الكفاح للخرسانة والبلوك",
        "7012554338" => "مصنع الكفاح للخرسانة الجاهزة والطابوق",
        "7012650300" => "مصنع شركة الكفاح للخرسانة الجاهزه",
        "7012767633" => "مصنع الكفاح للخرسانه المسبقه الصنع",
        "7012822115" => "فرع شركه الكفاح لمواد البناء",
        "7012840794" => "وليد حسن عبدالله العفالق قص وتركيب الرخام",
        "7012965427" => "شركة الكفاح القابضة مشروع زراعي",
        "7012970179" => "شركة الكفاح لمواد البناء مصنع للخرسانة الجاهزة",
        "7013001503" => "وكالة الكفاح للسفر والسياحه",
        "7013021725" => "شركة الكفاح للحراسات الامنية المدنية الخاصة",
        "7013153858" => "شركة الكفاح لمواد البناء للخدمات البيئية",
        "7013614099" => "مدارس اكاديمية الكفاح الأهلية للتعليم",
        "7013710277" => "كفاح للدعاية والإعلان",
        "7013775866" => "مصنع شركة الكفاح للخرسانة الجاهزة",
        "7014166131" => "مصنع الكفاح للخرسانة الجاهزة فرع شركة الكفاح لمواد البناء",
        "7014442615" => "شركة الكفاح القابضه فرع المقاولات",
        "7014698711" => "مصنع الكفاح للخرسانة الجاهزة والبلك العازل",
        "7014784685" => "مدارس اكاديمية الكفاح الأهلية للتعليم",
        "7015017218" => "شركة الكفاح لمواد البناء تاجير المعدات والنقليات",
        "7015080299" => "شركة الكفاح للتعليم شركة شخص واحد مساهمة سعودية",
        "7015090520" => "مصنع الكفاح للبوك العازل ترخيص صناعي",
        "7015152288" => "فرع شركة الكفاح لمواد البناء",
        "7016093556" => "شركة أفاق متجددة للطاقة",
        "7018439765" => "مكتب اسامه حسن العفالق للاستشارات الهندسيه",
    ];


    static $systemBusinessUnits = [
        "7001378525" => 7,
        "7012822115" => 7,
        "7012970179" => 7,
        "7015152288" => 7,
        "7015090520" => 7,
        "7012554338" => 7,
        "7011737652" => 7,
        "7006355593" => 7,
        "7011778425" => 7,
        "7012283227" => 7,
        "7012457771" => 7,
        "7012650300" => 7,
        "7012767633" => 17,
        "7013153858" => 7,
        "7013775866" => 7,
        "7014166131" => 7,
        "7014698711" => 7,
        "7015017218" => 7,

        "7013001503" => 27,
        "7013021725" => 29,
        "7001454094" => 1,
        "7004069782" => 10,
        "7013710277" => 11,
        "7004297979" => 2,
        "7014442615" => 4,
        "7001573273" => 8,
        "7012158551" => 8,
        "7009383964" => 3,
        "7012103938" => 20,
        "7013614099" => 20,
        "7014784685" => 20,
        "7015080299" => 20,
        "7001569826" => 17,
        "7001573638" => 30,
        "7001625107" => 26,
        "7005620625" => 49,
        "7006636109" => 4,
        "7008608585" => 54,
        "7011291965" => 26,
        "7016093556" => 50

    ];

    static $en_sponsers = [
        "7014442615" => "Al-Kifah Holding Company - Contracting Branch"
    ];


}